       01  SAMPLE-PAYROLL-FILE.                                     
        03  PAYROLL-INFO.                                        
         05  EMPNO                        PIC X(6).            
         05  GROSS_PAY                    PIC S9(15)V9(2) COMP-3.        
         05  TAX_AMOUNT                   PIC S9(15)V9(2) COMP-3.
         05  NET_PAY                      PIC S9(15)V9(2) COMP-3.
         05  WORKDEPT                     PIC X(3).
         05  PAY_DATE                     PIC X(8).
         05  CHEQUE_NO                    PIC X(5).
